#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Reference to undefined provider

  on main.tf line 33, in module "domain_management":
  33:     aws           = aws

There is no explicit declaration for local provider name "aws" in
module.domain_management, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.storage.data.external.get_paths: Reading...
module.api.data.local_file.mock_response_get_files["featured_projects"]: Reading...
module.api.data.local_file.mock_response_get_files["projects_mock"]: Reading...
module.api.data.local_file.mock_response_get_files["about_page_content"]: Reading...
module.api.data.archive_file.get_projects_lambda: Reading...
module.api.data.local_file.mock_response_get_files["projects_mock"]: Read complete after 0s [id=867ba54c568eaff06de27a0f1d2687401907a8a2]
module.api.data.local_file.mock_response_get_files["featured_projects"]: Read complete after 0s [id=e32261d3c5c27bd4e8a1dd61ec4b12c695eae63f]
module.api.data.local_file.mock_response_get_files["about_page_content"]: Read complete after 0s [id=a18b8a6559fe0c80eb86206fa18a09ad726d1eea]
module.api.data.archive_file.get_projects_lambda: Read complete after 0s [id=f7f978937c373bc027f65543fd33049c3d011203]
module.domain_management.aws_acm_certificate.thomaskimble_certificate_us_east_1: Refreshing state... [id=arn:aws:acm:us-east-1:287212251408:certificate/c84fb352-6443-4501-8dcd-7cef714df1d4]
module.storage.data.external.get_paths: Read complete after 0s [id=-]
module.cdn.aws_cloudfront_origin_access_control.thomaskimble_origin_access_control: Refreshing state... [id=EL0VR2NKFTVMT]
module.api.aws_iam_role.lambda_execution_role: Refreshing state... [id=lambda_execution_role]
module.frontend.data.aws_secretsmanager_secret.secret: Reading...
module.domain_management.aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/36b7b09b-b03e-4036-8a14-dfd49c4e4fff]
module.storage.aws_s3_bucket.thomaskimble_bucket: Refreshing state... [id=thomaskimble-storage]
module.domain_management.aws_route53_zone.thomaskimble: Refreshing state... [id=Z09261682MMR79C15BLZ9]
module.api.aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=ktjk0455h9]
module.database.aws_dynamodb_table.projects: Refreshing state... [id=projects]
module.domain_management.aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_email_CNAME]
module.domain_management.aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z09261682MMR79C15BLZ9__MX]
module.domain_management.aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z09261682MMR79C15BLZ9__TXT]
module.domain_management.aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_autodiscover_CNAME]
module.domain_management.aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_legacy_CNAME]
module.frontend.data.aws_secretsmanager_secret.secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
module.frontend.data.aws_secretsmanager_secret_version.current: Reading...
module.api.aws_api_gateway_resource.get_projects_resource: Refreshing state... [id=8mxv43]
module.api.aws_api_gateway_resource.mock_get_resources["featured_projects"]: Refreshing state... [id=kn1j9q]
module.api.aws_api_gateway_deployment.api_deployment: Refreshing state... [id=04f4ih]
module.api.aws_api_gateway_resource.mock_get_resources["projects_mock"]: Refreshing state... [id=yvc99a]
module.api.aws_api_gateway_resource.mock_get_resources["about_page_content"]: Refreshing state... [id=8em389]
module.frontend.data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
module.frontend.aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d212nepszzoptn]
module.domain_management.aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.domain_management.aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.api.aws_api_gateway_domain_name.thomaskimble_api_gateway_domain_name: Refreshing state... [id=api.thomaskimble.com]
module.api.aws_iam_policy.lambda_dynamodb_policy: Refreshing state... [id=arn:aws:iam::287212251408:policy/lambda_dynamodb_policy]
module.api.aws_api_gateway_method.get_projects_method: Refreshing state... [id=agm-ktjk0455h9-8mxv43-GET]
module.api.aws_api_gateway_stage.thomaskimble_prod: Refreshing state... [id=ags-ktjk0455h9-prod]
module.api.aws_api_gateway_method.mock_get_methods["featured_projects"]: Refreshing state... [id=agm-ktjk0455h9-kn1j9q-GET]
module.api.aws_api_gateway_method.mock_get_methods["projects_mock"]: Refreshing state... [id=agm-ktjk0455h9-yvc99a-GET]
module.api.aws_api_gateway_method.mock_get_methods["about_page_content"]: Refreshing state... [id=agm-ktjk0455h9-8em389-GET]
module.api.aws_api_gateway_method.cors_options_methods["featured_projects"]: Refreshing state... [id=agm-ktjk0455h9-kn1j9q-OPTIONS]
module.api.aws_api_gateway_method.cors_options_methods["projects_mock"]: Refreshing state... [id=agm-ktjk0455h9-yvc99a-OPTIONS]
module.api.aws_api_gateway_method.cors_options_methods["about_page_content"]: Refreshing state... [id=agm-ktjk0455h9-8em389-OPTIONS]
module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=2024-05-15 15:03:21.971 +0000 UTC]
module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation_us_east_1: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.api.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_execution_role-20240528235807393800000001]
module.api.aws_api_gateway_base_path_mapping.thomaskimble_api_gateway_mapping: Refreshing state... [id=api.thomaskimble.com/]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["about_page_content"]: Refreshing state... [id=agir-ktjk0455h9-8em389-GET-200]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["featured_projects"]: Refreshing state... [id=agir-ktjk0455h9-kn1j9q-GET-200]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["projects_mock"]: Refreshing state... [id=agir-ktjk0455h9-yvc99a-GET-200]
module.api.aws_api_gateway_integration.mock_get_integrations["featured_projects"]: Refreshing state... [id=agi-ktjk0455h9-kn1j9q-GET]
module.api.aws_api_gateway_integration.mock_get_integrations["projects_mock"]: Refreshing state... [id=agi-ktjk0455h9-yvc99a-GET]
module.api.aws_api_gateway_integration.mock_get_integrations["about_page_content"]: Refreshing state... [id=agi-ktjk0455h9-8em389-GET]
module.domain_management.aws_route53_record.thomaskimble_api_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_api_A]
module.api.aws_api_gateway_method_response.mock_get_method_responses["about_page_content"]: Refreshing state... [id=agmr-ktjk0455h9-8em389-GET-200]
module.api.aws_api_gateway_method_response.mock_get_method_responses["projects_mock"]: Refreshing state... [id=agmr-ktjk0455h9-yvc99a-GET-200]
module.api.aws_api_gateway_method_response.mock_get_method_responses["featured_projects"]: Refreshing state... [id=agmr-ktjk0455h9-kn1j9q-GET-200]
module.api.aws_api_gateway_method_response.cors_options_method_responses["featured_projects"]: Refreshing state... [id=agmr-ktjk0455h9-kn1j9q-OPTIONS-200]
module.api.aws_api_gateway_method_response.cors_options_method_responses["projects_mock"]: Refreshing state... [id=agmr-ktjk0455h9-yvc99a-OPTIONS-200]
module.api.aws_api_gateway_method_response.cors_options_method_responses["about_page_content"]: Refreshing state... [id=agmr-ktjk0455h9-8em389-OPTIONS-200]
module.api.aws_api_gateway_integration.cors_options_integration["featured_projects"]: Refreshing state... [id=agi-ktjk0455h9-kn1j9q-OPTIONS]
module.api.aws_api_gateway_integration.cors_options_integration["projects_mock"]: Refreshing state... [id=agi-ktjk0455h9-yvc99a-OPTIONS]
module.api.aws_api_gateway_integration.cors_options_integration["about_page_content"]: Refreshing state... [id=agi-ktjk0455h9-8em389-OPTIONS]
module.frontend.aws_amplify_branch.dev: Refreshing state... [id=d212nepszzoptn/dev]
module.frontend.aws_amplify_branch.main: Refreshing state... [id=d212nepszzoptn/main]
module.frontend.aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d212nepszzoptn/thomaskimble.com]
module.storage.aws_s3_bucket_policy.thomaskimble_bucket_policy: Refreshing state... [id=thomaskimble-storage]
module.storage.aws_s3_bucket_ownership_controls.thomaskimble_bucket_acl_ownership: Refreshing state... [id=thomaskimble-storage]
module.storage.aws_s3_object.create_paths["path_2"]: Refreshing state... [id=projects/friendship_mobility/media/]
module.storage.aws_s3_object.create_paths["path_3"]: Refreshing state... [id=projects/chatbot_intent/media/]
module.storage.aws_s3_object.create_paths["path_22"]: Refreshing state... [id=media/illustrations/blue/logo_text/]
module.storage.aws_s3_object.create_paths["path_12"]: Refreshing state... [id=media/illustrations/blue/featured_projects/]
module.storage.aws_s3_object.create_paths["path_29"]: Refreshing state... [id=media/illustrations/green/hero/]
module.storage.aws_s3_object.create_paths["path_9"]: Refreshing state... [id=projects/guitar_pedals/media/]
module.storage.aws_s3_object.create_paths["path_11"]: Refreshing state... [id=projects/thomaskimble_current/media/]
module.storage.aws_s3_object.create_paths["path_33"]: Refreshing state... [id=media/videos/]
module.storage.aws_s3_object.create_paths["path_32"]: Refreshing state... [id=media/images/]
module.storage.aws_s3_object.create_paths["path_30"]: Refreshing state... [id=media/illustrations/orange/hero/]
module.storage.aws_s3_object.create_paths["path_19"]: Refreshing state... [id=media/illustrations/green/logo/]
module.storage.aws_s3_object.create_paths["path_27"]: Refreshing state... [id=media/illustrations/blue/hero/]
module.storage.aws_s3_object.create_paths["path_5"]: Refreshing state... [id=projects/epuck_line/media/]
module.storage.aws_s3_object.create_paths["path_31"]: Refreshing state... [id=media/illustrations/purple/hero/]
module.storage.aws_s3_object.create_paths["path_28"]: Refreshing state... [id=media/illustrations/red/hero/]
module.storage.aws_s3_object.create_paths["path_24"]: Refreshing state... [id=media/illustrations/green/logo_text/]
module.storage.aws_s3_object.create_paths["path_21"]: Refreshing state... [id=media/illustrations/purple/logo/]
module.storage.aws_s3_object.create_paths["path_7"]: Refreshing state... [id=projects/ros_basics/media/]
module.storage.aws_s3_object.create_paths["path_15"]: Refreshing state... [id=media/illustrations/orange/featured_projects/]
module.storage.aws_s3_object.create_paths["path_10"]: Refreshing state... [id=projects/terraform_iac/media/]
module.storage.aws_s3_object.create_paths["path_8"]: Refreshing state... [id=projects/thomaskimble_legacy/media/]
module.storage.aws_s3_object.create_paths["path_18"]: Refreshing state... [id=media/illustrations/red/logo/]
module.storage.aws_s3_object.create_paths["path_1"]: Refreshing state... [id=projects/thymio_navigation/media/]
module.storage.aws_s3_object.create_paths["path_23"]: Refreshing state... [id=media/illustrations/red/logo_text/]
module.storage.aws_s3_object.create_paths["path_26"]: Refreshing state... [id=media/illustrations/purple/logo_text/]
module.storage.aws_s3_object.create_paths["path_25"]: Refreshing state... [id=media/illustrations/orange/logo_text/]
module.storage.aws_s3_object.create_paths["path_17"]: Refreshing state... [id=media/illustrations/blue/logo/]
module.storage.aws_s3_object.create_paths["path_14"]: Refreshing state... [id=media/illustrations/green/featured_projects/]
module.cdn.aws_cloudfront_distribution.thomaskimble_cloudfront_distribution: Refreshing state... [id=E1NVSILJBONNNS]
module.storage.aws_s3_object.create_paths["path_20"]: Refreshing state... [id=media/illustrations/orange/logo/]
module.storage.aws_s3_object.create_paths["path_16"]: Refreshing state... [id=media/illustrations/purple/featured_projects/]
module.storage.aws_s3_object.create_paths["path_6"]: Refreshing state... [id=projects/drone_swarm/media/]
module.storage.aws_s3_object.create_paths["path_0"]: Refreshing state... [id=projects/butterfly_shelf/media/]
module.storage.aws_s3_object.create_paths["path_13"]: Refreshing state... [id=media/illustrations/red/featured_projects/]
module.storage.aws_s3_object.create_paths["path_4"]: Refreshing state... [id=projects/rocket_crash/media/]
module.storage.aws_s3_bucket_acl.thomaskimble_bucket_acl: Refreshing state... [id=thomaskimble-storage,public-read]
module.domain_management.aws_route53_record.thomaskimble_storage_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_storage_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api.aws_api_gateway_integration.get_projects_integration will be created
  + resource "aws_api_gateway_integration" "get_projects_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "8mxv43"
      + rest_api_id             = "ktjk0455h9"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_lambda_function.get_projects will be created
  + resource "aws_lambda_function" "get_projects" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "api/lambda/get_projects.zip"
      + function_name                  = "GetProjectsFunction"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::287212251408:role/lambda_execution_role"
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "CLC2axozpXDnnQvNERt2HFUeQp/gzeRAjEFvoadTQ+c="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DYNAMODB_TABLE_NAME" = "projects"
            }
        }
    }

  # module.api.aws_lambda_permission.api_gateway_lambda_permission will be created
  + resource "aws_lambda_permission" "api_gateway_lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "GetProjectsFunction"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warnings:

- Reference to undefined provider
  on main.tf line 33 (and 1 more)

To see the full warning notes, run Terraform without -compact-warnings.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*